app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts"
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1  [["id", 2]]
---
  def index
    @accounts = Account.all
    @decision = $client.check_resources(
      principal: resource_principal,
      resources: resources
    )
    @allowed_resource_ids = @decision.results.filter do |result|
      result.actions['view'] == :EFFECT_ALLOW
    end.collect { |result| result.resource.id }
    @results = Account.where(id: @allowed_resource_ids)